Memorizer/app/controllers/memories_controller.rb

SELECT "memories".* FROM "memories"
---
  def index
    @memories = Memory.all

UPDATE "memories" SET "source" = $1, "title" = $2, "date" = $3, "picture" = $4, "body" = $5, "updated_at" = $6 WHERE "memories"."id" = $7  [["source", "asdfasdf"], ["title", "asdfadsf"], ["date", "asdfasdf"], ["picture", "asdf"], ["body", "asdfadsf"], ["updated_at", "2019-07-11 13:44:08.384069"], ["id", 2]]
---
  def update
    if @memory.update(memory_params)

DELETE FROM "memories" WHERE "memories"."id" = $1  [["id", 1]]
---
  def destroy
    @memory.destroy

SELECT  "memories".* FROM "memories" WHERE "memories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_memory
      @memory = Memory.find(params[:id])